from aiogram.types import InlineKeyboardMarkup
from aiogram.utils.keyboard import InlineKeyboardBuilder

def get_kb() -> InlineKeyboardMarkup:
    currency_dict = {
        "AUD": "🇦🇺 1 Австралийский доллар",
        "AZN": "🇦🇿 1 Азербайджанский манат",
        "GBP": "🇬🇧 1 Фунт стерлингов",
        "AMD": "🇦🇲 100 Армянских драмов",
        "BYN": "🇧🇾 1 Белорусский рубль",
        "BGN": "🇧🇬 1 Болгарский лев",
        "BRL": "🇧🇷 1 Бразильский реал",
        "HUF": "🇭🇺 100 Форинтов",
        "VND": "🇻🇳 10000 Донгов",
        "HKD": "🇭🇰 1 Гонконгский доллар",
        "GEL": "🇬🇪 1 Лари",
        "DKK": "🇩🇰 1 Датская крона",
        "AED": "🇦🇪 1 Дирхам ОАЭ",
        "USD": "🇺🇸 1 Доллар США",
        "EUR": "🇪🇺 1 Евро",
        "EGP": "🇪🇬 10 Египетских фунтов",
        "INR": "🇮🇳 10 Индийских рупий",
        "IDR": "🇮🇩 10000 Рупий",
        "KZT": "🇰🇿 100 Тенге",
        "CAD": "🇨🇦 1 Канадский доллар",
        "QAR": "🇶🇦 1 Катарский риал",
        "KGS": "🇰🇬 10 Сомов",
        "CNY": "🇨🇳 1 Юань",
        "MDL": "🇲🇩 10 Молдавских леев",
        "NZD": "🇳🇿 1 Новозеландский доллар",
        "NOK": "🇳🇴 10 Норвежских крон",
        "PLN": "🇵🇱 1 Злотый",
        "RON": "🇷🇴 1 Румынский лей",
        "XDR": "🌐 1 СДР (специальные права заимствования)",
        "SGD": "🇸🇬 1 Сингапурский доллар",
        "TJS": "🇹🇯 10 Сомони",
        "THB": "🇹🇭 10 Батов",
        "TRY": "🇹🇷 10 Турецких лир",
        "TMT": "🇹🇲 1 Новый туркменский манат",
        "UZS": "🇺🇿 10000 Узбекских сумов",
        "UAH": "🇺🇦 10 Гривен",
        "CZK": "🇨🇿 10 Чешских крон",
        "SEK": "🇸🇪 10 Шведских крон",
        "CHF": "🇨🇭 1 Швейцарский франк",
        "RSD": "🇷🇸 100 Сербских динаров",
        "ZAR": "🇿🇦 10 Рэндов",
        "KRW": "🇰🇷 1000 Вон",
        "JPY": "🇯🇵 100 Иен"
    }
    kb = InlineKeyboardBuilder()
    for key, value in currency_dict.items():
        kb.button(text=value, callback_data=key)
    kb.adjust(1)
    return kb.as_markup()